Revit 2015 API
IFCTypeInfo Class
 An info class representing data about a given element type, typically used for Revit family types.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This class is no longer needed by native or .NET code.")]
public class IFCTypeInfo : IDisposable
Visual Basic
<ObsoleteAttribute("This class is no longer needed by native or .NET code.")> _
Public Class IFCTypeInfo _
	Implements IDisposable
Visual C++
[ObsoleteAttribute(L"This class is no longer needed by native or .NET code.")]
public ref class IFCTypeInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCTypeInfo
See Also
IFCTypeInfo Members
Autodesk.Revit.DB.IFC Namespace